Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: كلما أرادوا أن يخرجوا منها من غم أعيدوا فيها وذوقوا عذاب الحريق
en: Every time they want to get out of Hellfire from anguish, they will be returned to it, and [it will be said], "Taste the punishment of the Burning Fire!"

source: إن الله يدخل الذين آمنوا وعملوا الصالحات جنات تجري من تحتها الأنهار يحلون فيها من أساور من ذهب ولؤلؤا ولباسهم فيها حرير
en: Indeed, Allah will admit those who believe and do righteous deeds to gardens beneath which rivers flow. They will be adorned therein with bracelets of gold and pearl, and their garments therein will be silk.

source: وهدوا إلى الطيب من القول وهدوا إلى صراط الحميد
en: And they had been guided [in worldly life] to good speech, and they were guided to the path of the Praiseworthy.

source: إن الذين كفروا ويصدون عن سبيل الله والمسجد الحرام الذي جعلناه للناس سواء العاكف فيه والباد ومن يرد فيه بإلحاد بظلم نذقه من عذاب أليم
en: Indeed, those who have disbelieved and avert [people] from the way of Allah and [from] al-Masjid al-Haram, which We made for the people - equal are the resident therein and one from outside; and [also] whoever intends [a deed] therein of deviation [in religion] or wrongdoing - We will make him taste of a painful punishment.

source: وإذ بوأنا لإبراهيم مكان البيت أن لا تشرك بي شيئا وطهر بيتي للطائفين والقائمين والركع السجود
en: And [mention, O Muhammad], when We designated for Abraham the site of the House, [saying], "Do not associate anything with Me and purify My House for those who perform Tawaf and those who stand [in prayer] and those who bow and prostrate.

source: وأذن في الناس بالحج يأتوك رجالا وعلى كل ضامر يأتين من كل فج عميق
en: And proclaim to the people the Hajj [pilgrimage]; they will come to you on foot and on every lean camel; they will come from every distant pass -

source: ليشهدوا منافع لهم ويذكروا اسم الله في أيام معلومات على ما رزقهم من بهيمة الأنعام فكلوا منها وأطعموا البائس الفقير
en: That they may witness benefits for themselves and mention the name of Allah on known days over what He has provided for them of [sacrificial] animals. So eat of them and feed the miserable and poor.

source: ثم ليقضوا تفثهم وليوفوا نذورهم وليطوفوا بالبيت العتيق
en: Then let them end their untidiness and fulfill their vows and perform Tawaf around the ancient House."

source: ذلك ومن يعظم حرمات الله فهو خير له عند ربه وأحلت لكم الأنعام إلا ما يتلى عليكم فاجتنبوا الرجس من الأوثان واجتنبوا قول الزور
en: That [has been commanded], and whoever honors the sacred ordinances of Allah - it is best for him in the sight of his Lord. And permitted to you are the grazing livestock, except what is recited to you. So avoid the uncleanliness of idols and avoid false statement,

source: حنفاء لله غير مشركين به ومن يشرك بالله فكأنما خر من السماء فتخطفه الطير أو تهوي به الريح في مكان سحيق
en: Inclining [only] to Allah, not associating [anything] with Him. And he who associates with Allah - it is as though he had fallen from the sky and was snatched by the birds or the wind carried him down into a remote place.

source: ذلك ومن يعظم شعائر الله فإنها من تقوى القلوب
en: That [is so]. And whoever honors the symbols of Allah - indeed, it is from the piety of hearts.

source: لكم فيها منافع إلى أجل مسمى ثم محلها إلى البيت العتيق
en: For you the animals marked for sacrifice are benefits for a specified term; then their place of sacrifice is at the ancient House.

source: ولكل أمة جعلنا منسكا ليذكروا اسم الله على ما رزقهم من بهيمة الأنعام فإلهكم إله واحد فله أسلموا وبشر المخبتين
en: And for all religion We have appointed a rite [of sacrifice] that they may mention the name of Allah over what He has provided for them of [sacrificial] animals. For your god is one God, so to Him submit. And, [O Muhammad], give good tidings to the humble [before their Lord]

source: الذين إذا ذكر الله وجلت قلوبهم والصابرين على ما أصابهم والمقيمي الصلاة ومما رزقناهم ينفقون
en: Who, when Allah is mentioned, their hearts are fearful, and [to] the patient over what has afflicted them, and the establishers of prayer and those who spend from what We have provided them.

source: والبدن جعلناها لكم من شعائر الله لكم فيها خير فاذكروا اسم الله عليها صواف فإذا وجبت جنوبها فكلوا منها وأطعموا القانع والمعتر كذلك سخرناها لكم لعلكم تشكرون
en: And the camels and cattle We have appointed for you as among the symbols of Allah; for you therein is good. So mention the name of Allah upon them when lined up [for sacrifice]; and when they are [lifeless] on their sides, then eat from them and feed the needy and the beggar. Thus have We subjected them to you that you may be grateful.

source: لن ينال الله لحومها ولا دماؤها ولكن يناله التقوى منكم كذلك سخرها لكم لتكبروا الله على ما هداكم وبشر المحسنين
en: Their meat will not reach Allah, nor will their blood, but what reaches Him is piety from you. Thus have We subjected them to you that you may glorify Allah for that [to] which He has guided you; and give good tidings to the doers of good.

source: إن الله يدافع عن الذين آمنوا إن الله لا يحب كل خوان كفور
en: Indeed, Allah defends those who have believed. Indeed, Allah does not like everyone treacherous and ungrateful.

source: أذن للذين يقاتلون بأنهم ظلموا وإن الله على نصرهم لقدير
en: Permission [to fight] has been given to those who are being fought, because they were wronged. And indeed, Allah is competent to give them victory.

source: الذين أخرجوا من ديارهم بغير حق إلا أن يقولوا ربنا الله ولولا دفع الله الناس بعضهم ببعض لهدمت صوامع وبيع وصلوات ومساجد يذكر فيها اسم الله كثيرا ولينصرن الله من ينصره إن الله لقوي عزيز
en: [They are] those who have been evicted from their homes without right - only because they say, "Our Lord is Allah." And were it not that Allah checks the people, some by means of others, there would have been demolished monasteries, churches, synagogues, and mosques in which the name of Allah is much mentioned. And Allah will surely support those who support Him. Indeed, Allah is Powerful and Exalted in Might.

source: الذين إن مكناهم في الأرض أقاموا الصلاة وآتوا الزكاة وأمروا بالمعروف ونهوا عن المنكر ولله عاقبة الأمور
en: [And they are] those who, if We give them authority in the land, establish prayer and give zakah and enjoin what is right and forbid what is wrong. And to Allah belongs the outcome of [all] matters.

source: وإن يكذبوك فقد كذبت قبلهم قوم نوح وعاد وثمود
en: And if they deny you, [O Muhammad] - so, before them, did the people of Noah and 'Aad and Thamud deny [their prophets],

source: وقوم إبراهيم وقوم لوط
en: And the people of Abraham and the people of Lot

source: وأصحاب مدين وكذب موسى فأمليت للكافرين ثم أخذتهم فكيف كان نكير
en: And the inhabitants of Madyan. And Moses was denied, so I prolonged enjoyment for the disbelievers; then I seized them, and how [terrible] was My reproach.

source: فكأين من قرية أهلكناها وهي ظالمة فهي خاوية على عروشها وبئر معطلة وقصر مشيد
en: And how many a city did We destroy while it was committing wrong - so it is [now] fallen into ruin - and [how many] an abandoned well and [how many] a lofty palace.

source: أفلم يسيروا في الأرض فتكون لهم قلوب يعقلون بها أو آذان يسمعون بها فإنها لا تعمى الأبصار ولكن تعمى القلوب التي في الصدور
en: So have they not traveled through the earth and have hearts by which to reason and ears by which to hear? For indeed, it is not eyes that are blinded, but blinded are the hearts which are within the breasts.

source: ويستعجلونك بالعذاب ولن يخلف الله وعده وإن يوما عند ربك كألف سنة مما تعدون
en: And they urge you to hasten the punishment. But Allah will never fail in His promise. And indeed, a day with your Lord is like a thousand years of those which you count.

source: وكأين من قرية أمليت لها وهي ظالمة ثم أخذتها وإلي المصير
en: And for how many a city did I prolong enjoyment while it was committing wrong. Then I seized it, and to Me is the [final] destination.

source: قل يا أيها الناس إنما أنا لكم نذير مبين
en: Say, "O people, I am only to you a clear warner."

source: فالذين آمنوا وعملوا الصالحات لهم مغفرة ورزق كريم
en: And those who have believed and done righteous deeds - for them is forgiveness and noble provision.

source: والذين سعوا في آياتنا معاجزين أولئك أصحاب الجحيم
en: But the ones who strove against Our verses, [seeking] to cause failure - those are the companions of Hellfire.

source: وما أرسلنا من قبلك من رسول ولا نبي إلا إذا تمنى ألقى الشيطان في أمنيته فينسخ الله ما يلقي الشيطان ثم يحكم الله آياته والله عليم حكيم
en: And We did not send before you any messenger or prophet except that when he spoke [or recited], Satan threw into it [some misunderstanding]. But Allah abolishes that which Satan throws in; then Allah makes precise His verses. And Allah is Knowing and Wise.

source: ليجعل ما يلقي الشيطان فتنة للذين في قلوبهم مرض والقاسية قلوبهم وإن الظالمين لفي شقاق بعيد
en: [That is] so He may make what Satan throws in a trial for those within whose hearts is disease and those hard of heart. And indeed, the wrongdoers are in extreme dissension.

source: وليعلم الذين أوتوا العلم أنه الحق من ربك فيؤمنوا به فتخبت له قلوبهم وإن الله لهاد الذين آمنوا إلى صراط مستقيم
en: And so those who were given knowledge may know that it is the truth from your Lord and [therefore] believe in it, and their hearts humbly submit to it. And indeed is Allah the Guide of those who have believed to a straight path.

source: ولا يزال الذين كفروا في مرية منه حتى تأتيهم الساعة بغتة أو يأتيهم عذاب يوم عقيم
en: But those who disbelieve will not cease to be in doubt of it until the Hour comes upon them unexpectedly or there comes to them the punishment of a barren Day.

source: الملك يومئذ لله يحكم بينهم فالذين آمنوا وعملوا الصالحات في جنات النعيم
en: [All] sovereignty that Day is for Allah; He will judge between them. So they who believed and did righteous deeds will be in the Gardens of Pleasure.

source: والذين كفروا وكذبوا بآياتنا فأولئك لهم عذاب مهين
en: And they who disbelieved and denied Our signs - for those there will be a humiliating punishment.

source: والذين هاجروا في سبيل الله ثم قتلوا أو ماتوا ليرزقنهم الله رزقا حسنا وإن الله لهو خير الرازقين
en: And those who emigrated for the cause of Allah and then were killed or died - Allah will surely provide for them a good provision. And indeed, it is Allah who is the best of providers.

source: ليدخلنهم مدخلا يرضونه وإن الله لعليم حليم
en: He will surely cause them to enter an entrance with which they will be pleased, and indeed, Allah is Knowing and Forbearing.

source: ذلك ومن عاقب بمثل ما عوقب به ثم بغي عليه لينصرنه الله إن الله لعفو غفور
en: That [is so]. And whoever responds [to injustice] with the equivalent of that with which he was harmed and then is tyrannized - Allah will surely aid him. Indeed, Allah is Pardoning and Forgiving.

source: ذلك بأن الله يولج الليل في النهار ويولج النهار في الليل وأن الله سميع بصير
en: That is because Allah causes the night to enter the day and causes the day to enter the night and because Allah is Hearing and Seeing.

source: ذلك بأن الله هو الحق وأن ما يدعون من دونه هو الباطل وأن الله هو العلي الكبير
en: That is because Allah is the Truth, and that which they call upon other than Him is falsehood, and because Allah is the Most High, the Grand.

source: ألم تر أن الله أنزل من السماء ماء فتصبح الأرض مخضرة إن الله لطيف خبير
en: Do you not see that Allah has sent down rain from the sky and the earth becomes green? Indeed, Allah is Subtle and Acquainted.

source: له ما في السماوات وما في الأرض وإن الله لهو الغني الحميد
en: To Him belongs what is in the heavens and what is on the earth. And indeed, Allah is the Free of need, the Praiseworthy.

source: ألم تر أن الله سخر لكم ما في الأرض والفلك تجري في البحر بأمره ويمسك السماء أن تقع على الأرض إلا بإذنه إن الله بالناس لرءوف رحيم
en: Do you not see that Allah has subjected to you whatever is on the earth and the ships which run through the sea by His command? And He restrains the sky from falling upon the earth, unless by His permission. Indeed Allah, to the people, is Kind and Merciful.

source: وهو الذي أحياكم ثم يميتكم ثم يحييكم إن الإنسان لكفور
en: And He is the one who gave you life; then He causes you to die and then will [again] give you life. Indeed, mankind is ungrateful.

source: لكل أمة جعلنا منسكا هم ناسكوه فلا ينازعنك في الأمر وادع إلى ربك إنك لعلى هدى مستقيم
en: For every religion We have appointed rites which they perform. So, [O Muhammad], let the disbelievers not contend with you over the matter but invite them to your Lord. Indeed, you are upon straight guidance.

source: وإن جادلوك فقل الله أعلم بما تعملون
en: And if they dispute with you, then say, "Allah is most knowing of what you do.

source: الله يحكم بينكم يوم القيامة فيما كنتم فيه تختلفون
en: Allah will judge between you on the Day of Resurrection concerning that over which you used to differ."

source: ألم تعلم أن الله يعلم ما في السماء والأرض إن ذلك في كتاب إن ذلك على الله يسير
en: Do you not know that Allah knows what is in the heaven and earth? Indeed, that is in a Record. Indeed that, for Allah, is easy.

source: ويعبدون من دون الله ما لم ينزل به سلطانا وما ليس لهم به علم وما للظالمين من نصير
en: And they worship besides Allah that for which He has not sent down authority and that of which they have no knowledge. And there will not be for the wrongdoers any helper.

source: وإذا تتلى عليهم آياتنا بينات تعرف في وجوه الذين كفروا المنكر يكادون يسطون بالذين يتلون عليهم آياتنا قل أفأنبئكم بشر من ذلكم النار وعدها الله الذين كفروا وبئس المصير
en: And when Our verses are recited to them as clear evidences, you recognize in the faces of those who disbelieve disapproval. They are almost on the verge of assaulting those who recite to them Our verses. Say, "Then shall I inform you of [what is] worse than that? [It is] the Fire which Allah has promised those who disbelieve, and wretched is the destination."

source: يا أيها الناس ضرب مثل فاستمعوا له إن الذين تدعون من دون الله لن يخلقوا ذبابا ولو اجتمعوا له وإن يسلبهم الذباب شيئا لا يستنقذوه منه ضعف الطالب والمطلوب
en: O people, an example is presented, so listen to it. Indeed, those you invoke besides Allah will never create [as much as] a fly, even if they gathered together for that purpose. And if the fly should steal away from them a [tiny] thing, they could not recover it from him. Weak are the pursuer and pursued.

source: ما قدروا الله حق قدره إن الله لقوي عزيز
en: They have not appraised Allah with true appraisal. Indeed, Allah is Powerful and Exalted in Might.

source: الله يصطفي من الملائكة رسلا ومن الناس إن الله سميع بصير
en: Allah chooses from the angels messengers and from the people. Indeed, Allah is Hearing and Seeing.

source: يعلم ما بين أيديهم وما خلفهم وإلى الله ترجع الأمور
en: He knows what is [presently] before them and what will be after them. And to Allah will be returned [all] matters.

source: يا أيها الذين آمنوا اركعوا واسجدوا واعبدوا ربكم وافعلوا الخير لعلكم تفلحون
en: O you who have believed, bow and prostrate and worship your Lord and do good - that you may succeed.

source: وجاهدوا في الله حق جهاده هو اجتباكم وما جعل عليكم في الدين من حرج ملة أبيكم إبراهيم هو سماكم المسلمين من قبل وفي هذا ليكون الرسول شهيدا عليكم وتكونوا شهداء على الناس فأقيموا الصلاة وآتوا الزكاة واعتصموا بالله هو مولاكم فنعم المولى ونعم النصير
en: And strive for Allah with the striving due to Him. He has chosen you and has not placed upon you in the religion any difficulty. [It is] the religion of your father, Abraham. Allah named you "Muslims" before [in former scriptures] and in this [revelation] that the Messenger may be a witness over you and you may be witnesses over the people. So establish prayer and give zakah and hold fast to Allah. He is your protector; and excellent is the protector, and excellent is the helper.

source: قد أفلح المؤمنون
en: Certainly will the believers have succeeded:

source: الذين هم في صلاتهم خاشعون
en: They who are during their prayer humbly submissive

source: والذين هم عن اللغو معرضون
en: And they who turn away from ill speech

source: والذين هم للزكاة فاعلون
en: And they who are observant of zakah

source: والذين هم لفروجهم حافظون
en: And they who guard their private parts

source: إلا على أزواجهم أو ما ملكت أيمانهم فإنهم غير ملومين
en: Except from their wives or those their right hands possess, for indeed, they will not be blamed -

source: فمن ابتغى وراء ذلك فأولئك هم العادون
en: But whoever seeks beyond that, then those are the transgressors -

source: والذين هم لأماناتهم وعهدهم راعون
en: And they who are to their trusts and their promises attentive

source: والذين هم على صلواتهم يحافظون
en: And they who carefully maintain their prayers -

source: أولئك هم الوارثون
en: Those are the inheritors

source: الذين يرثون الفردوس هم فيها خالدون
en: Who will inherit al-Firdaus. They will abide therein eternally.

source: ولقد خلقنا الإنسان من سلالة من طين
en: And certainly did We create man from an extract of clay.

source: ثم جعلناه نطفة في قرار مكين
en: Then We placed him as a sperm-drop in a firm lodging.

source: ثم خلقنا النطفة علقة فخلقنا العلقة مضغة فخلقنا المضغة عظاما فكسونا العظام لحما ثم أنشأناه خلقا آخر فتبارك الله أحسن الخالقين
en: Then We made the sperm-drop into a clinging clot, and We made the clot into a lump [of flesh], and We made [from] the lump, bones, and We covered the bones with flesh; then We developed him into another creation. So blessed is Allah, the best of creators.

source: ثم إنكم بعد ذلك لميتون
en: Then indeed, after that you are to die.

source: ثم إنكم يوم القيامة تبعثون
en: Then indeed you, on the Day of Resurrection, will be resurrected.

source: ولقد خلقنا فوقكم سبع طرائق وما كنا عن الخلق غافلين
en: And We have created above you seven layered heavens, and never have We been of [Our] creation unaware.

source: وأنزلنا من السماء ماء بقدر فأسكناه في الأرض وإنا على ذهاب به لقادرون
en: And We have sent down rain from the sky in a measured amount and settled it in the earth. And indeed, We are Able to take it away.

source: فأنشأنا لكم به جنات من نخيل وأعناب لكم فيها فواكه كثيرة ومنها تأكلون
en: And We brought forth for you thereby gardens of palm trees and grapevines in which for you are abundant fruits and from which you eat.

source: وشجرة تخرج من طور سيناء تنبت بالدهن وصبغ للآكلين
en: And [We brought forth] a tree issuing from Mount Sinai which produces oil and food for those who eat.

source: وإن لكم في الأنعام لعبرة نسقيكم مما في بطونها ولكم فيها منافع كثيرة ومنها تأكلون
en: And indeed, for you in livestock is a lesson. We give you drink from that which is in their bellies, and for you in them are numerous benefits, and from them you eat.

source: وعليها وعلى الفلك تحملون
en: And upon them and on ships you are carried.

source: ولقد أرسلنا نوحا إلى قومه فقال يا قوم اعبدوا الله ما لكم من إله غيره أفلا تتقون
en: And We had certainly sent Noah to his people, and he said, "O my people, worship Allah; you have no deity other than Him; then will you not fear Him?"

source: فقال الملأ الذين كفروا من قومه ما هذا إلا بشر مثلكم يريد أن يتفضل عليكم ولو شاء الله لأنزل ملائكة ما سمعنا بهذا في آبائنا الأولين
en: But the eminent among those who disbelieved from his people said, "This is not but a man like yourselves who wishes to take precedence over you; and if Allah had willed [to send a messenger], He would have sent down angels. We have not heard of this among our forefathers.

source: إن هو إلا رجل به جنة فتربصوا به حتى حين
en: He is not but a man possessed with madness, so wait concerning him for a time."

source: قال رب انصرني بما كذبون
en: [Noah] said, "My Lord, support me because they have denied me."

source: فأوحينا إليه أن اصنع الفلك بأعيننا ووحينا فإذا جاء أمرنا وفار التنور فاسلك فيها من كل زوجين اثنين وأهلك إلا من سبق عليه القول منهم ولا تخاطبني في الذين ظلموا إنهم مغرقون
en: So We inspired to him, "Construct the ship under Our observation, and Our inspiration, and when Our command comes and the oven overflows, put into the ship from each [creature] two mates and your family, except those for whom the decree [of destruction] has proceeded. And do not address Me concerning those who have wronged; indeed, they are to be drowned.

source: فإذا استويت أنت ومن معك على الفلك فقل الحمد لله الذي نجانا من القوم الظالمين
en: And when you have boarded the ship, you and those with you, then say, 'Praise to Allah who has saved us from the wrongdoing people.'

source: وقل رب أنزلني منزلا مباركا وأنت خير المنزلين
en: And say, 'My Lord, let me land at a blessed landing place, and You are the best to accommodate [us].' "

source: إن في ذلك لآيات وإن كنا لمبتلين
en: Indeed in that are signs, and indeed, We are ever testing [Our servants].

source: ثم أنشأنا من بعدهم قرنا آخرين
en: Then We produced after them a generation of others.

source: فأرسلنا فيهم رسولا منهم أن اعبدوا الله ما لكم من إله غيره أفلا تتقون
en: And We sent among them a messenger from themselves, [saying], "Worship Allah; you have no deity other than Him; then will you not fear Him?"

source: وقال الملأ من قومه الذين كفروا وكذبوا بلقاء الآخرة وأترفناهم في الحياة الدنيا ما هذا إلا بشر مثلكم يأكل مما تأكلون منه ويشرب مما تشربون
en: And the eminent among his people who disbelieved and denied the meeting of the Hereafter while We had given them luxury in the worldly life said, "This is not but a man like yourselves. He eats of that from which you eat and drinks of what you drink.

source: ولئن أطعتم بشرا مثلكم إنكم إذا لخاسرون
en: And if you should obey a man like yourselves, indeed, you would then be losers.

source: أيعدكم أنكم إذا متم وكنتم ترابا وعظاما أنكم مخرجون
en: Does he promise you that when you have died and become dust and bones that you will be brought forth [once more]?

source: هيهات هيهات لما توعدون
en: How far, how far, is that which you are promised.

source: إن هي إلا حياتنا الدنيا نموت ونحيا وما نحن بمبعوثين
en: Life is not but our worldly life - we die and live, but we will not be resurrected.

source: إن هو إلا رجل افترى على الله كذبا وما نحن له بمؤمنين
en: He is not but a man who has invented a lie about Allah, and we will not believe him."

source: قال عما قليل ليصبحن نادمين
en: [Allah] said, "After a little, they will surely become regretful."

source: فأخذتهم الصيحة بالحق فجعلناهم غثاء فبعدا للقوم الظالمين
en: So the shriek seized them in truth, and We made them as [plant] stubble. Then away with the wrongdoing people.

source: ثم أنشأنا من بعدهم قرونا آخرين
en: Then We produced after them other generations.

source: ثم أرسلنا رسلنا تترى كل ما جاء أمة رسولها كذبوه فأتبعنا بعضهم بعضا وجعلناهم أحاديث فبعدا لقوم لا يؤمنون
en: Then We sent Our messengers in succession. Every time there came to a nation its messenger, they denied him, so We made them follow one another [to destruction], and We made them narrations. So away with a people who do not believe.

source: ثم أرسلنا موسى وأخاه هارون بآياتنا وسلطان مبين
en: Then We sent Moses and his brother Aaron with Our signs and a clear authority

source: إلى فرعون وملئه فاستكبروا وكانوا قوما عالين
en: To Pharaoh and his establishment, but they were arrogant and were a haughty people.

source: فقالوا أنؤمن لبشرين مثلنا وقومهما لنا عابدون
en: They said, "Should we believe two men like ourselves while their people are for us in servitude?"

source: فكذبوهما فكانوا من المهلكين
en: So they denied them and were of those destroyed.

source: ولقد آتينا موسى الكتاب لعلهم يهتدون
en: And We certainly gave Moses the Scripture that perhaps they would be guided.

source: وجعلنا ابن مريم وأمه آية وآويناهما إلى ربوة ذات قرار ومعين
en: And We made the son of Mary and his mother a sign and sheltered them within a high ground having level [areas] and flowing water.

source: يا أيها الرسل كلوا من الطيبات واعملوا صالحا إني بما تعملون عليم
en: [Allah said], "O messengers, eat from the good foods and work righteousness. Indeed, I, of what you do, am Knowing.

source: وإن هذه أمتكم أمة واحدة وأنا ربكم فاتقون
en: And indeed this, your religion, is one religion, and I am your Lord, so fear Me."
